
## Plan Result (tiny_virtual_machines)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * terraform_data.ansible[&#34;mariadb&#34;]
  * module.tiny_containers[&#34;mariadb0&#34;].proxmox_virtual_environment_container.this
  * module.tiny_containers[&#34;mariadb1&#34;].proxmox_virtual_environment_container.this
  * module.tiny_containers[&#34;mariadb2&#34;].proxmox_virtual_environment_container.this
  * module.tiny_containers[&#34;proxysql0&#34;].proxmox_virtual_environment_container.this
  * module.tiny_containers[&#34;proxysql1&#34;].proxmox_virtual_environment_container.this
  * module.tiny_containers[&#34;proxysql2&#34;].proxmox_virtual_environment_container.this
* Replace
  * proxmox_virtual_environment_download_file.tiny_images[&#34;hela-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;loki-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;thor-jammy-server-cloudimg-amd64.img&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_virtual_environment_download_file.tiny_images["hela-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 691074048 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.tiny_images["loki-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 691074048 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.tiny_images["thor-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 691074048 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # terraform_data.ansible["mariadb"] will be created
  + resource "terraform_data" "ansible" {
      + id               = (known after apply)
      + triggers_replace = [
          + "20-03-2026-1200",
          + <<-EOT
                - name: Install and configure MariaDB Galera Cluster
                  hosts: mariadb0, mariadb1, mariadb2
                  gather_facts: true
                  vars:
                    galera_cluster_name: "galera_cluster"
                    galera_nodes: ["10.151.16.210", "10.151.16.211", "10.151.16.212"]
                    mariadb_version: "11.4"
                    mariadb_bind_address: "0.0.0.0"
                    mariadb_datadir: "/var/lib/mysql"
                    mariadb_databases: []
                    bootstrap_galera: false
                  roles:
                  - role: prep
                    install_pkgs: ["apt-transport-https", "ca-certificates", "curl", "software-properties-common", "python3-pip", "python3-setuptools"]
                    disable_multipath: false
                  tasks:
                  - set_fact:
                      mariadb_root_password: "{{ lookup('ansible.builtin.file', 'mariadb_root_password') }}"
                    when: mariadb_root_password is undefined
                  - set_fact:
                      mariadb_galera_password: "{{ lookup('ansible.builtin.file', 'mariadb_galera_password') }}"
                    when: mariadb_galera_password is undefined
                  - set_fact:
                      proxysql_monitor_password: "{{ lookup('ansible.builtin.file', 'proxysql_monitor_password') }}"
                    when: proxysql_monitor_password is undefined
                  - name: Add MariaDB apt key
                    ansible.builtin.apt_key:
                      url: https://mariadb.org/mariadb_release_signing_key.pgp
                      state: present
                  - name: Add MariaDB repository
                    ansible.builtin.apt_repository:
                      repo: "deb https://downloads.mariadb.com/MariaDB/mariadb-{{ mariadb_version }}/repo/ubuntu {{ ansible_distribution_release }} main"
                      state: present
                  - name: Install MariaDB and Galera packages
                    apt:
                      pkg:
                      - mariadb-server
                      - galera-4
                      - mariadb-backup
                      - rsync
                      - python3-pymysql
                      state: latest
                      update_cache: true
                    when: not ansible_check_mode
                  - name: ensures /etc/mysql/conf.d dir exists
                    file:
                      path: /etc/mysql/conf.d
                      state: directory
                  - name: Copy Galera configuration template
                    template:
                      src: templates/galera.cnf.j2
                      dest: /etc/mysql/conf.d/galera.cnf
                      owner: root
                      group: root
                      mode: '0600'
                  - name: Stop MariaDB service on all nodes before bootstrapping
                    service:
                      name: mariadb
                      state: stopped
                    when: bootstrap_galera | bool
                  - name: Bootstrap Galera cluster on primary node (mariadb0)
                    command: galera_new_cluster
                    when: inventory_hostname == 'mariadb0' and bootstrap_galera | bool
                  - name: Set MariaDB root password
                    community.mysql.mysql_user:
                      name: root
                      password: "{{ mariadb_root_password }}"
                      login_unix_socket: /run/mysqld/mysqld.sock
                      state: present
                    when: inventory_hostname == 'mariadb0'
                  - name: Create Galera SST user
                    community.mysql.mysql_user:
                      name: galera_sst
                      password: "{{ mariadb_galera_password }}"
                      priv: "*.*:RELOAD,LOCK TABLES,PROCESS,REPLICATION CLIENT"
                      host: "{{ item }}"
                      login_unix_socket: /run/mysqld/mysqld.sock
                      state: present
                    loop: "{{ galera_nodes + ['localhost'] }}"
                    when: inventory_hostname == 'mariadb0'
                  - name: Create ProxySQL monitor user
                    community.mysql.mysql_user:
                      name: proxysql_monitor
                      password: "{{ proxysql_monitor_password }}"
                      priv: "*.*:USAGE,REPLICATION CLIENT"
                      host: "%"
                      login_unix_socket: /run/mysqld/mysqld.sock
                      state: present
                    when: inventory_hostname == 'mariadb0'
                  - name: Start MariaDB on secondary nodes
                    service:
                      name: mariadb
                      state: started
                      enabled: true
                    when: inventory_hostname != 'mariadb0' and bootstrap_galera | bool
                  - name: Ensure MariaDB is started and enabled
                    service:
                      name: mariadb
                      state: started
                      enabled: true
                    when: not (bootstrap_galera | bool)
                  - name: Create application databases
                    community.mysql.mysql_db:
                      name: "{{ item.name }}"
                      state: present
                      login_unix_socket: /run/mysqld/mysqld.sock
                    loop: "{{ mariadb_databases }}"
                    when:
                    - inventory_hostname == 'mariadb0'
                    - mariadb_databases | length > 0
                  - name: Create application database users
                    community.mysql.mysql_user:
                      name: "{{ item.user }}"
                      password: "{{ item.password }}"
                      priv: "{{ item.name }}.*:{{ item.privs | default('ALL PRIVILEGES') }}"
                      host: "{{ item.host | default('%') }}"
                      login_unix_socket: /run/mysqld/mysqld.sock
                      state: present
                    loop: "{{ mariadb_databases }}"
                    when:
                    - inventory_hostname == 'mariadb0'
                    - mariadb_databases | length > 0
                
                - name: Install and configure ProxySQL
                  hosts: proxysql0, proxysql1, proxysql2
                  gather_facts: true
                  vars:
                    galera_nodes: ["10.151.16.210", "10.151.16.211", "10.151.16.212"]
                    mariadb_databases: []
                    vip: "10.151.16.219/24"
                    keepalived_virtual_router_id: 152
                    keepalive:
                      proxysql0:
                        peers: |-
                          "10.151.16.217"
                          "10.151.16.218"
                        state: "MASTER"
                        priority: 150
                      proxysql1:
                        peers: |-
                          "10.151.16.216"
                          "10.151.16.218"
                        state: "BACKUP"
                        priority: 100
                      proxysql2:
                        peers: |-
                          "10.151.16.216"
                          "10.151.16.217"
                        state: "BACKUP"
                        priority: 100
                  roles:
                  - role: prep
                    install_pkgs: ["apt-transport-https", "ca-certificates", "curl", "software-properties-common"]
                    disable_multipath: false
                  tasks:
                  - set_fact:
                      proxysql_admin_password: "{{ lookup('ansible.builtin.file', 'proxysql_admin_password') }}"
                    when: proxysql_admin_password is undefined
                  - set_fact:
                      proxysql_monitor_password: "{{ lookup('ansible.builtin.file', 'proxysql_monitor_password') }}"
                    when: proxysql_monitor_password is undefined
                  - set_fact:
                      keepalived_proxysql_pass: "{{ lookup('ansible.builtin.file', 'ProxySQL-Keepalived-Password') }}"
                    when: keepalived_proxysql_pass is undefined
                  - name: ensures /etc/keepalived dir exists
                    file:
                      path: /etc/keepalived
                      state: directory
                  - name: Copy KeepAlived configuration template
                    template:
                      src: templates/keepalived-proxysql.conf.j2
                      dest: /etc/keepalived/keepalived.conf
                    vars:
                      keepalived_pass: "{{ keepalived_proxysql_pass }}"
                    notify:
                    - Restart Keepalived
                  - name: Update apt and install keepalived
                    apt:
                      pkg:
                      - keepalived
                      - libipset13
                      state: latest
                      update_cache: true
                    when: not ansible_check_mode
                  - name: Start and enable Keepalived
                    service:
                      name: keepalived
                      state: started
                      enabled: true
                  - name: Add ProxySQL apt key
                    ansible.builtin.apt_key:
                      url: https://repo.proxysql.com/ProxySQL/repo_pub_key
                      state: present
                  - name: Add ProxySQL repository
                    ansible.builtin.apt_repository:
                      repo: "deb https://repo.proxysql.com/ProxySQL/proxysql-2.7.x/{{ ansible_distribution_release }}/ ./"
                      state: present
                  - name: Install ProxySQL
                    apt:
                      pkg:
                      - proxysql2
                      state: latest
                      update_cache: true
                    when: not ansible_check_mode
                  - name: Copy ProxySQL configuration template
                    template:
                      src: templates/proxysql.cnf.j2
                      dest: /etc/proxysql.cnf
                      owner: root
                      group: root
                      mode: '0600'
                    notify:
                    - Restart ProxySQL
                  - name: Start and enable ProxySQL
                    service:
                      name: proxysql
                      state: started
                      enabled: true
                  handlers:
                  - name: Restart Keepalived
                    service:
                      name: keepalived
                      state: restarted
                  - name: Restart ProxySQL
                    service:
                      name: proxysql
                      state: restarted
            EOT,
        ]
    }

  # module.tiny_containers["mariadb0"].proxmox_virtual_environment_container.this will be created
  + resource "proxmox_virtual_environment_container" "this" {
      + description    = <<-EOT
            MariaDB Galera Cluster Node 0 - Hela
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "hela"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "terraform",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = true
      + vm_id          = 270

      + cpu {
          + architecture = "amd64"
          + cores        = 2
          + units        = 1024
        }

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 8
        }

      + features {
          + fuse    = false
          + keyctl  = false
          + nesting = true
        }

      + initialization {
          + hostname = "mariadb0"

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.210/24"
                  + gateway = "10.151.16.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDM6YQbnTJYYO6ANWiTwAU6LYLgwPkOu5sbDiUCYJt0dYgYUHzRa1cQsVE2ooLlmxwtHuL/8tjQtajL/HCaqr+XF41inGw3rz4cIXsQreRwudJNdP9Ba+2eaLxKJ2UzNi6S7J89Bw/og02leb+OdCZSJDYG9J6xr+8/Ndsga5xeiJr8Jht55199bKLviuLYjoO39GAiZzmu08WMA34P/grZyakkuMFlWXQNyABHpN6xnxQ3O6OqDd7F942MnTrM2xChbM/XXtPKLmRhPdbxqHHLYeLxv/xFA3MnOhI+G0izA/7JsT+0104wioZH+F8Ck9HzoJrLyjZLTLYzv4JydLWGtOjbLOD6jCd4cPlt4z28DqsulRqSrc5A3zMu3fhNjKBfWC3oH0rTrFcm1nc+U60Fois7/T9+3KSjH9YuR/7sLIxeQ74X8cr5d+9pkp34ffb5fVilAln426Tts6kzIEY8kuKT1nAGwuPKlTXvLpn4V9G2s9ugqSvJz5YYNL5r5es= alexb@Bancey-W11",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4Vx68tO5cVPyWqC1l9eVrpFkLcQ7GV0tkdmR1Hx0k6wdtAGOFY4/20uI47wBFs0WAQwV1HR/hx8RSsCGVAuoqPqxYVPVAfyG38MyM70txdepKE2U2jRXq4tbwAfziOyllZFLSqP+uRWJ5rtffOV8rbDNOat8VBEIGIBsVlmtTHVwZfJvILyzI7pA4YLyweBFAJRBwVN/wP+Kylq4qs7khlwILTD/20/mLNWJGYqMRg58+rGWdJRhfLHgMV51oLpSDS7aHbhkVLjoVuLeqUARYfMdrPPf0lDWGlKAsRyIy1EO9Or7hk6BKTB5hA4G11vRmhoc9d9jcuoArOpUtKWQqoRU74GpSeGLmN2cUndUDrY4kEPzFORHBlKe5W1jt2rc7NRIhduOakrfRmzZGv3N2zoYin69XcRMaAwFXkCT9zIBSGYYvEoXLwX5DynmfHcCvl3/CPYRPX7oFQLMN0ghCWYCmibmTRLD0boB88hFGog/mun51L+aJyLvjBQHXaU6m5gTkJ3LUfkhZbbWPzhgyqLdw7MUfGF9LU5S8sEO71MxmiI76vLxfO/rpUoQpVG0oRde1TAwY7wgnWwFb7MmJ736+tLKzaFhshySrFodnRmcALzxkWYbNV+FI2Mz8ZdkTLvveJEmaiGdgf2B/RO2+VqX/QiCSJvFqcA6/eB35JQ== alexb@DESKTOP-CN2369K",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC8GRj4esk6kfB54F2h3M25PgcyOAl8mEey5BgHVkel05g+dBUGb/ERmoQ5itrMNhOy2mtrsguHDEW9tatwmKfmQQvZcbGKAt/BZjnQtTa/5iPdmq6C/B0URr7oTBBS9ClDfJOQNIxBKFcIujpkVtQHN84UhAw8UMwEMdKQtgiW1chUERSAuMQ+qzNtoFnZ1Do3C5gSiX0d1eZWr8UqCUab4cpjLnTQZO2KDIrrVJ1H9FGFida4vXEReDKxpzxp6IL+JjWwEzBF0TavPNRPRnbVdro+PT5Fk4Jz+GJtX4191xz1ePwbGKRYpyJQg58s9/nl5UobMvQNsx/cBAlX6ebemMcjD9YiCC1HK3rU9a5v8TDffqVpG50fbuL+c7aWWshMeIveat4WFTGPgnvAvT+ojQSSi2cVIL5qB/7s3uZkCOXTGeaTeKvCTF+d5U6DMjbTP5oOPGpcgWGzqvxT+0/fVDRQayTTsNGfxRGCDRwEIqBKSbo6HnMmQSt6zXtICUfVmldm+20kIwtaqej98tDRsB1/WUnaQaIjCeGHv8rZoqPla9t+8vk9bTHrJ6h9pxacNnECrtcSvA0Zs7u8Z3wkEVm25Uq6Kzdl8NqhWLIG8ct7Mmgs7p3Oj/5Qsrnt2+zUdVGOXwCKiDQnMsoeJ9/a3/p4pY+tnx6d9M5sbourxQ== alexb@Bancey-W11",
                ]
              + password = (sensitive value)
            }
        }

      + memory {
          + dedicated = 2048
          + swap      = 0
        }

      + network_interface {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "eth0"
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + template_file_id = "local:vztmpl/ubuntu-24.04-standard_24.04-2_amd64.tar.zst"
          + type             = "ubuntu"
        }

      + startup {
          + down_delay = -1
          + order      = 1
          + up_delay   = 5
        }
    }

  # module.tiny_containers["mariadb1"].proxmox_virtual_environment_container.this will be created
  + resource "proxmox_virtual_environment_container" "this" {
      + description    = <<-EOT
            MariaDB Galera Cluster Node 1 - Loki
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "loki"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "terraform",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = true
      + vm_id          = 271

      + cpu {
          + architecture = "amd64"
          + cores        = 2
          + units        = 1024
        }

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 8
        }

      + features {
          + fuse    = false
          + keyctl  = false
          + nesting = true
        }

      + initialization {
          + hostname = "mariadb1"

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.211/24"
                  + gateway = "10.151.16.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDM6YQbnTJYYO6ANWiTwAU6LYLgwPkOu5sbDiUCYJt0dYgYUHzRa1cQsVE2ooLlmxwtHuL/8tjQtajL/HCaqr+XF41inGw3rz4cIXsQreRwudJNdP9Ba+2eaLxKJ2UzNi6S7J89Bw/og02leb+OdCZSJDYG9J6xr+8/Ndsga5xeiJr8Jht55199bKLviuLYjoO39GAiZzmu08WMA34P/grZyakkuMFlWXQNyABHpN6xnxQ3O6OqDd7F942MnTrM2xChbM/XXtPKLmRhPdbxqHHLYeLxv/xFA3MnOhI+G0izA/7JsT+0104wioZH+F8Ck9HzoJrLyjZLTLYzv4JydLWGtOjbLOD6jCd4cPlt4z28DqsulRqSrc5A3zMu3fhNjKBfWC3oH0rTrFcm1nc+U60Fois7/T9+3KSjH9YuR/7sLIxeQ74X8cr5d+9pkp34ffb5fVilAln426Tts6kzIEY8kuKT1nAGwuPKlTXvLpn4V9G2s9ugqSvJz5YYNL5r5es= alexb@Bancey-W11",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4Vx68tO5cVPyWqC1l9eVrpFkLcQ7GV0tkdmR1Hx0k6wdtAGOFY4/20uI47wBFs0WAQwV1HR/hx8RSsCGVAuoqPqxYVPVAfyG38MyM70txdepKE2U2jRXq4tbwAfziOyllZFLSqP+uRWJ5rtffOV8rbDNOat8VBEIGIBsVlmtTHVwZfJvILyzI7pA4YLyweBFAJRBwVN/wP+Kylq4qs7khlwILTD/20/mLNWJGYqMRg58+rGWdJRhfLHgMV51oLpSDS7aHbhkVLjoVuLeqUARYfMdrPPf0lDWGlKAsRyIy1EO9Or7hk6BKTB5hA4G11vRmhoc9d9jcuoArOpUtKWQqoRU74GpSeGLmN2cUndUDrY4kEPzFORHBlKe5W1jt2rc7NRIhduOakrfRmzZGv3N2zoYin69XcRMaAwFXkCT9zIBSGYYvEoXLwX5DynmfHcCvl3/CPYRPX7oFQLMN0ghCWYCmibmTRLD0boB88hFGog/mun51L+aJyLvjBQHXaU6m5gTkJ3LUfkhZbbWPzhgyqLdw7MUfGF9LU5S8sEO71MxmiI76vLxfO/rpUoQpVG0oRde1TAwY7wgnWwFb7MmJ736+tLKzaFhshySrFodnRmcALzxkWYbNV+FI2Mz8ZdkTLvveJEmaiGdgf2B/RO2+VqX/QiCSJvFqcA6/eB35JQ== alexb@DESKTOP-CN2369K",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC8GRj4esk6kfB54F2h3M25PgcyOAl8mEey5BgHVkel05g+dBUGb/ERmoQ5itrMNhOy2mtrsguHDEW9tatwmKfmQQvZcbGKAt/BZjnQtTa/5iPdmq6C/B0URr7oTBBS9ClDfJOQNIxBKFcIujpkVtQHN84UhAw8UMwEMdKQtgiW1chUERSAuMQ+qzNtoFnZ1Do3C5gSiX0d1eZWr8UqCUab4cpjLnTQZO2KDIrrVJ1H9FGFida4vXEReDKxpzxp6IL+JjWwEzBF0TavPNRPRnbVdro+PT5Fk4Jz+GJtX4191xz1ePwbGKRYpyJQg58s9/nl5UobMvQNsx/cBAlX6ebemMcjD9YiCC1HK3rU9a5v8TDffqVpG50fbuL+c7aWWshMeIveat4WFTGPgnvAvT+ojQSSi2cVIL5qB/7s3uZkCOXTGeaTeKvCTF+d5U6DMjbTP5oOPGpcgWGzqvxT+0/fVDRQayTTsNGfxRGCDRwEIqBKSbo6HnMmQSt6zXtICUfVmldm+20kIwtaqej98tDRsB1/WUnaQaIjCeGHv8rZoqPla9t+8vk9bTHrJ6h9pxacNnECrtcSvA0Zs7u8Z3wkEVm25Uq6Kzdl8NqhWLIG8ct7Mmgs7p3Oj/5Qsrnt2+zUdVGOXwCKiDQnMsoeJ9/a3/p4pY+tnx6d9M5sbourxQ== alexb@Bancey-W11",
                ]
              + password = (sensitive value)
            }
        }

      + memory {
          + dedicated = 2048
          + swap      = 0
        }

      + network_interface {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "eth0"
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + template_file_id = "local:vztmpl/ubuntu-24.04-standard_24.04-2_amd64.tar.zst"
          + type             = "ubuntu"
        }

      + startup {
          + down_delay = -1
          + order      = 1
          + up_delay   = 5
        }
    }

  # module.tiny_containers["mariadb2"].proxmox_virtual_environment_container.this will be created
  + resource "proxmox_virtual_environment_container" "this" {
      + description    = <<-EOT
            MariaDB Galera Cluster Node 2 - Thor
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "thor"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "terraform",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = true
      + vm_id          = 272

      + cpu {
          + architecture = "amd64"
          + cores        = 2
          + units        = 1024
        }

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 8
        }

      + features {
          + fuse    = false
          + keyctl  = false
          + nesting = true
        }

      + initialization {
          + hostname = "mariadb2"

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.212/24"
                  + gateway = "10.151.16.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDM6YQbnTJYYO6ANWiTwAU6LYLgwPkOu5sbDiUCYJt0dYgYUHzRa1cQsVE2ooLlmxwtHuL/8tjQtajL/HCaqr+XF41inGw3rz4cIXsQreRwudJNdP9Ba+2eaLxKJ2UzNi6S7J89Bw/og02leb+OdCZSJDYG9J6xr+8/Ndsga5xeiJr8Jht55199bKLviuLYjoO39GAiZzmu08WMA34P/grZyakkuMFlWXQNyABHpN6xnxQ3O6OqDd7F942MnTrM2xChbM/XXtPKLmRhPdbxqHHLYeLxv/xFA3MnOhI+G0izA/7JsT+0104wioZH+F8Ck9HzoJrLyjZLTLYzv4JydLWGtOjbLOD6jCd4cPlt4z28DqsulRqSrc5A3zMu3fhNjKBfWC3oH0rTrFcm1nc+U60Fois7/T9+3KSjH9YuR/7sLIxeQ74X8cr5d+9pkp34ffb5fVilAln426Tts6kzIEY8kuKT1nAGwuPKlTXvLpn4V9G2s9ugqSvJz5YYNL5r5es= alexb@Bancey-W11",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4Vx68tO5cVPyWqC1l9eVrpFkLcQ7GV0tkdmR1Hx0k6wdtAGOFY4/20uI47wBFs0WAQwV1HR/hx8RSsCGVAuoqPqxYVPVAfyG38MyM70txdepKE2U2jRXq4tbwAfziOyllZFLSqP+uRWJ5rtffOV8rbDNOat8VBEIGIBsVlmtTHVwZfJvILyzI7pA4YLyweBFAJRBwVN/wP+Kylq4qs7khlwILTD/20/mLNWJGYqMRg58+rGWdJRhfLHgMV51oLpSDS7aHbhkVLjoVuLeqUARYfMdrPPf0lDWGlKAsRyIy1EO9Or7hk6BKTB5hA4G11vRmhoc9d9jcuoArOpUtKWQqoRU74GpSeGLmN2cUndUDrY4kEPzFORHBlKe5W1jt2rc7NRIhduOakrfRmzZGv3N2zoYin69XcRMaAwFXkCT9zIBSGYYvEoXLwX5DynmfHcCvl3/CPYRPX7oFQLMN0ghCWYCmibmTRLD0boB88hFGog/mun51L+aJyLvjBQHXaU6m5gTkJ3LUfkhZbbWPzhgyqLdw7MUfGF9LU5S8sEO71MxmiI76vLxfO/rpUoQpVG0oRde1TAwY7wgnWwFb7MmJ736+tLKzaFhshySrFodnRmcALzxkWYbNV+FI2Mz8ZdkTLvveJEmaiGdgf2B/RO2+VqX/QiCSJvFqcA6/eB35JQ== alexb@DESKTOP-CN2369K",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC8GRj4esk6kfB54F2h3M25PgcyOAl8mEey5BgHVkel05g+dBUGb/ERmoQ5itrMNhOy2mtrsguHDEW9tatwmKfmQQvZcbGKAt/BZjnQtTa/5iPdmq6C/B0URr7oTBBS9ClDfJOQNIxBKFcIujpkVtQHN84UhAw8UMwEMdKQtgiW1chUERSAuMQ+qzNtoFnZ1Do3C5gSiX0d1eZWr8UqCUab4cpjLnTQZO2KDIrrVJ1H9FGFida4vXEReDKxpzxp6IL+JjWwEzBF0TavPNRPRnbVdro+PT5Fk4Jz+GJtX4191xz1ePwbGKRYpyJQg58s9/nl5UobMvQNsx/cBAlX6ebemMcjD9YiCC1HK3rU9a5v8TDffqVpG50fbuL+c7aWWshMeIveat4WFTGPgnvAvT+ojQSSi2cVIL5qB/7s3uZkCOXTGeaTeKvCTF+d5U6DMjbTP5oOPGpcgWGzqvxT+0/fVDRQayTTsNGfxRGCDRwEIqBKSbo6HnMmQSt6zXtICUfVmldm+20kIwtaqej98tDRsB1/WUnaQaIjCeGHv8rZoqPla9t+8vk9bTHrJ6h9pxacNnECrtcSvA0Zs7u8Z3wkEVm25Uq6Kzdl8NqhWLIG8ct7Mmgs7p3Oj/5Qsrnt2+zUdVGOXwCKiDQnMsoeJ9/a3/p4pY+tnx6d9M5sbourxQ== alexb@Bancey-W11",
                ]
              + password = (sensitive value)
            }
        }

      + memory {
          + dedicated = 2048
          + swap      = 0
        }

      + network_interface {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "eth0"
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + template_file_id = "local:vztmpl/ubuntu-24.04-standard_24.04-2_amd64.tar.zst"
          + type             = "ubuntu"
        }

      + startup {
          + down_delay = -1
          + order      = 1
          + up_delay   = 5
        }
    }

  # module.tiny_containers["proxysql0"].proxmox_virtual_environment_container.this will be created
  + resource "proxmox_virtual_environment_container" "this" {
      + description    = <<-EOT
            ProxySQL 0 - Hela - MariaDB Galera Cluster Load Balancer
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "hela"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "terraform",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = true
      + vm_id          = 273

      + cpu {
          + architecture = "amd64"
          + cores        = 1
          + units        = 1024
        }

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 8
        }

      + features {
          + fuse    = false
          + keyctl  = false
          + nesting = true
        }

      + initialization {
          + hostname = "proxysql0"

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.216/24"
                  + gateway = "10.151.16.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDM6YQbnTJYYO6ANWiTwAU6LYLgwPkOu5sbDiUCYJt0dYgYUHzRa1cQsVE2ooLlmxwtHuL/8tjQtajL/HCaqr+XF41inGw3rz4cIXsQreRwudJNdP9Ba+2eaLxKJ2UzNi6S7J89Bw/og02leb+OdCZSJDYG9J6xr+8/Ndsga5xeiJr8Jht55199bKLviuLYjoO39GAiZzmu08WMA34P/grZyakkuMFlWXQNyABHpN6xnxQ3O6OqDd7F942MnTrM2xChbM/XXtPKLmRhPdbxqHHLYeLxv/xFA3MnOhI+G0izA/7JsT+0104wioZH+F8Ck9HzoJrLyjZLTLYzv4JydLWGtOjbLOD6jCd4cPlt4z28DqsulRqSrc5A3zMu3fhNjKBfWC3oH0rTrFcm1nc+U60Fois7/T9+3KSjH9YuR/7sLIxeQ74X8cr5d+9pkp34ffb5fVilAln426Tts6kzIEY8kuKT1nAGwuPKlTXvLpn4V9G2s9ugqSvJz5YYNL5r5es= alexb@Bancey-W11",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4Vx68tO5cVPyWqC1l9eVrpFkLcQ7GV0tkdmR1Hx0k6wdtAGOFY4/20uI47wBFs0WAQwV1HR/hx8RSsCGVAuoqPqxYVPVAfyG38MyM70txdepKE2U2jRXq4tbwAfziOyllZFLSqP+uRWJ5rtffOV8rbDNOat8VBEIGIBsVlmtTHVwZfJvILyzI7pA4YLyweBFAJRBwVN/wP+Kylq4qs7khlwILTD/20/mLNWJGYqMRg58+rGWdJRhfLHgMV51oLpSDS7aHbhkVLjoVuLeqUARYfMdrPPf0lDWGlKAsRyIy1EO9Or7hk6BKTB5hA4G11vRmhoc9d9jcuoArOpUtKWQqoRU74GpSeGLmN2cUndUDrY4kEPzFORHBlKe5W1jt2rc7NRIhduOakrfRmzZGv3N2zoYin69XcRMaAwFXkCT9zIBSGYYvEoXLwX5DynmfHcCvl3/CPYRPX7oFQLMN0ghCWYCmibmTRLD0boB88hFGog/mun51L+aJyLvjBQHXaU6m5gTkJ3LUfkhZbbWPzhgyqLdw7MUfGF9LU5S8sEO71MxmiI76vLxfO/rpUoQpVG0oRde1TAwY7wgnWwFb7MmJ736+tLKzaFhshySrFodnRmcALzxkWYbNV+FI2Mz8ZdkTLvveJEmaiGdgf2B/RO2+VqX/QiCSJvFqcA6/eB35JQ== alexb@DESKTOP-CN2369K",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC8GRj4esk6kfB54F2h3M25PgcyOAl8mEey5BgHVkel05g+dBUGb/ERmoQ5itrMNhOy2mtrsguHDEW9tatwmKfmQQvZcbGKAt/BZjnQtTa/5iPdmq6C/B0URr7oTBBS9ClDfJOQNIxBKFcIujpkVtQHN84UhAw8UMwEMdKQtgiW1chUERSAuMQ+qzNtoFnZ1Do3C5gSiX0d1eZWr8UqCUab4cpjLnTQZO2KDIrrVJ1H9FGFida4vXEReDKxpzxp6IL+JjWwEzBF0TavPNRPRnbVdro+PT5Fk4Jz+GJtX4191xz1ePwbGKRYpyJQg58s9/nl5UobMvQNsx/cBAlX6ebemMcjD9YiCC1HK3rU9a5v8TDffqVpG50fbuL+c7aWWshMeIveat4WFTGPgnvAvT+ojQSSi2cVIL5qB/7s3uZkCOXTGeaTeKvCTF+d5U6DMjbTP5oOPGpcgWGzqvxT+0/fVDRQayTTsNGfxRGCDRwEIqBKSbo6HnMmQSt6zXtICUfVmldm+20kIwtaqej98tDRsB1/WUnaQaIjCeGHv8rZoqPla9t+8vk9bTHrJ6h9pxacNnECrtcSvA0Zs7u8Z3wkEVm25Uq6Kzdl8NqhWLIG8ct7Mmgs7p3Oj/5Qsrnt2+zUdVGOXwCKiDQnMsoeJ9/a3/p4pY+tnx6d9M5sbourxQ== alexb@Bancey-W11",
                ]
              + password = (sensitive value)
            }
        }

      + memory {
          + dedicated = 512
          + swap      = 0
        }

      + network_interface {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "eth0"
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + template_file_id = "local:vztmpl/ubuntu-24.04-standard_24.04-2_amd64.tar.zst"
          + type             = "ubuntu"
        }

      + startup {
          + down_delay = -1
          + order      = 2
          + up_delay   = 10
        }
    }

  # module.tiny_containers["proxysql1"].proxmox_virtual_environment_container.this will be created
  + resource "proxmox_virtual_environment_container" "this" {
      + description    = <<-EOT
            ProxySQL 1 - Loki - MariaDB Galera Cluster Load Balancer
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "loki"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "terraform",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = true
      + vm_id          = 274

      + cpu {
          + architecture = "amd64"
          + cores        = 1
          + units        = 1024
        }

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 8
        }

      + features {
          + fuse    = false
          + keyctl  = false
          + nesting = true
        }

      + initialization {
          + hostname = "proxysql1"

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.217/24"
                  + gateway = "10.151.16.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDM6YQbnTJYYO6ANWiTwAU6LYLgwPkOu5sbDiUCYJt0dYgYUHzRa1cQsVE2ooLlmxwtHuL/8tjQtajL/HCaqr+XF41inGw3rz4cIXsQreRwudJNdP9Ba+2eaLxKJ2UzNi6S7J89Bw/og02leb+OdCZSJDYG9J6xr+8/Ndsga5xeiJr8Jht55199bKLviuLYjoO39GAiZzmu08WMA34P/grZyakkuMFlWXQNyABHpN6xnxQ3O6OqDd7F942MnTrM2xChbM/XXtPKLmRhPdbxqHHLYeLxv/xFA3MnOhI+G0izA/7JsT+0104wioZH+F8Ck9HzoJrLyjZLTLYzv4JydLWGtOjbLOD6jCd4cPlt4z28DqsulRqSrc5A3zMu3fhNjKBfWC3oH0rTrFcm1nc+U60Fois7/T9+3KSjH9YuR/7sLIxeQ74X8cr5d+9pkp34ffb5fVilAln426Tts6kzIEY8kuKT1nAGwuPKlTXvLpn4V9G2s9ugqSvJz5YYNL5r5es= alexb@Bancey-W11",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4Vx68tO5cVPyWqC1l9eVrpFkLcQ7GV0tkdmR1Hx0k6wdtAGOFY4/20uI47wBFs0WAQwV1HR/hx8RSsCGVAuoqPqxYVPVAfyG38MyM70txdepKE2U2jRXq4tbwAfziOyllZFLSqP+uRWJ5rtffOV8rbDNOat8VBEIGIBsVlmtTHVwZfJvILyzI7pA4YLyweBFAJRBwVN/wP+Kylq4qs7khlwILTD/20/mLNWJGYqMRg58+rGWdJRhfLHgMV51oLpSDS7aHbhkVLjoVuLeqUARYfMdrPPf0lDWGlKAsRyIy1EO9Or7hk6BKTB5hA4G11vRmhoc9d9jcuoArOpUtKWQqoRU74GpSeGLmN2cUndUDrY4kEPzFORHBlKe5W1jt2rc7NRIhduOakrfRmzZGv3N2zoYin69XcRMaAwFXkCT9zIBSGYYvEoXLwX5DynmfHcCvl3/CPYRPX7oFQLMN0ghCWYCmibmTRLD0boB88hFGog/mun51L+aJyLvjBQHXaU6m5gTkJ3LUfkhZbbWPzhgyqLdw7MUfGF9LU5S8sEO71MxmiI76vLxfO/rpUoQpVG0oRde1TAwY7wgnWwFb7MmJ736+tLKzaFhshySrFodnRmcALzxkWYbNV+FI2Mz8ZdkTLvveJEmaiGdgf2B/RO2+VqX/QiCSJvFqcA6/eB35JQ== alexb@DESKTOP-CN2369K",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC8GRj4esk6kfB54F2h3M25PgcyOAl8mEey5BgHVkel05g+dBUGb/ERmoQ5itrMNhOy2mtrsguHDEW9tatwmKfmQQvZcbGKAt/BZjnQtTa/5iPdmq6C/B0URr7oTBBS9ClDfJOQNIxBKFcIujpkVtQHN84UhAw8UMwEMdKQtgiW1chUERSAuMQ+qzNtoFnZ1Do3C5gSiX0d1eZWr8UqCUab4cpjLnTQZO2KDIrrVJ1H9FGFida4vXEReDKxpzxp6IL+JjWwEzBF0TavPNRPRnbVdro+PT5Fk4Jz+GJtX4191xz1ePwbGKRYpyJQg58s9/nl5UobMvQNsx/cBAlX6ebemMcjD9YiCC1HK3rU9a5v8TDffqVpG50fbuL+c7aWWshMeIveat4WFTGPgnvAvT+ojQSSi2cVIL5qB/7s3uZkCOXTGeaTeKvCTF+d5U6DMjbTP5oOPGpcgWGzqvxT+0/fVDRQayTTsNGfxRGCDRwEIqBKSbo6HnMmQSt6zXtICUfVmldm+20kIwtaqej98tDRsB1/WUnaQaIjCeGHv8rZoqPla9t+8vk9bTHrJ6h9pxacNnECrtcSvA0Zs7u8Z3wkEVm25Uq6Kzdl8NqhWLIG8ct7Mmgs7p3Oj/5Qsrnt2+zUdVGOXwCKiDQnMsoeJ9/a3/p4pY+tnx6d9M5sbourxQ== alexb@Bancey-W11",
                ]
              + password = (sensitive value)
            }
        }

      + memory {
          + dedicated = 512
          + swap      = 0
        }

      + network_interface {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "eth0"
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + template_file_id = "local:vztmpl/ubuntu-24.04-standard_24.04-2_amd64.tar.zst"
          + type             = "ubuntu"
        }

      + startup {
          + down_delay = -1
          + order      = 2
          + up_delay   = 10
        }
    }

  # module.tiny_containers["proxysql2"].proxmox_virtual_environment_container.this will be created
  + resource "proxmox_virtual_environment_container" "this" {
      + description    = <<-EOT
            ProxySQL 2 - Thor - MariaDB Galera Cluster Load Balancer
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "thor"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + tags           = [
          + "terraform",
        ]
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = true
      + vm_id          = 275

      + cpu {
          + architecture = "amd64"
          + cores        = 1
          + units        = 1024
        }

      + disk {
          + acl               = false
          + datastore_id      = "local-lvm"
          + path_in_datastore = (known after apply)
          + quota             = false
          + replicate         = false
          + size              = 8
        }

      + features {
          + fuse    = false
          + keyctl  = false
          + nesting = true
        }

      + initialization {
          + hostname = "proxysql2"

          + ip_config {
              + ipv4 {
                  + address = "10.151.16.218/24"
                  + gateway = "10.151.16.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDM6YQbnTJYYO6ANWiTwAU6LYLgwPkOu5sbDiUCYJt0dYgYUHzRa1cQsVE2ooLlmxwtHuL/8tjQtajL/HCaqr+XF41inGw3rz4cIXsQreRwudJNdP9Ba+2eaLxKJ2UzNi6S7J89Bw/og02leb+OdCZSJDYG9J6xr+8/Ndsga5xeiJr8Jht55199bKLviuLYjoO39GAiZzmu08WMA34P/grZyakkuMFlWXQNyABHpN6xnxQ3O6OqDd7F942MnTrM2xChbM/XXtPKLmRhPdbxqHHLYeLxv/xFA3MnOhI+G0izA/7JsT+0104wioZH+F8Ck9HzoJrLyjZLTLYzv4JydLWGtOjbLOD6jCd4cPlt4z28DqsulRqSrc5A3zMu3fhNjKBfWC3oH0rTrFcm1nc+U60Fois7/T9+3KSjH9YuR/7sLIxeQ74X8cr5d+9pkp34ffb5fVilAln426Tts6kzIEY8kuKT1nAGwuPKlTXvLpn4V9G2s9ugqSvJz5YYNL5r5es= alexb@Bancey-W11",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC4Vx68tO5cVPyWqC1l9eVrpFkLcQ7GV0tkdmR1Hx0k6wdtAGOFY4/20uI47wBFs0WAQwV1HR/hx8RSsCGVAuoqPqxYVPVAfyG38MyM70txdepKE2U2jRXq4tbwAfziOyllZFLSqP+uRWJ5rtffOV8rbDNOat8VBEIGIBsVlmtTHVwZfJvILyzI7pA4YLyweBFAJRBwVN/wP+Kylq4qs7khlwILTD/20/mLNWJGYqMRg58+rGWdJRhfLHgMV51oLpSDS7aHbhkVLjoVuLeqUARYfMdrPPf0lDWGlKAsRyIy1EO9Or7hk6BKTB5hA4G11vRmhoc9d9jcuoArOpUtKWQqoRU74GpSeGLmN2cUndUDrY4kEPzFORHBlKe5W1jt2rc7NRIhduOakrfRmzZGv3N2zoYin69XcRMaAwFXkCT9zIBSGYYvEoXLwX5DynmfHcCvl3/CPYRPX7oFQLMN0ghCWYCmibmTRLD0boB88hFGog/mun51L+aJyLvjBQHXaU6m5gTkJ3LUfkhZbbWPzhgyqLdw7MUfGF9LU5S8sEO71MxmiI76vLxfO/rpUoQpVG0oRde1TAwY7wgnWwFb7MmJ736+tLKzaFhshySrFodnRmcALzxkWYbNV+FI2Mz8ZdkTLvveJEmaiGdgf2B/RO2+VqX/QiCSJvFqcA6/eB35JQ== alexb@DESKTOP-CN2369K",
                  + "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC8GRj4esk6kfB54F2h3M25PgcyOAl8mEey5BgHVkel05g+dBUGb/ERmoQ5itrMNhOy2mtrsguHDEW9tatwmKfmQQvZcbGKAt/BZjnQtTa/5iPdmq6C/B0URr7oTBBS9ClDfJOQNIxBKFcIujpkVtQHN84UhAw8UMwEMdKQtgiW1chUERSAuMQ+qzNtoFnZ1Do3C5gSiX0d1eZWr8UqCUab4cpjLnTQZO2KDIrrVJ1H9FGFida4vXEReDKxpzxp6IL+JjWwEzBF0TavPNRPRnbVdro+PT5Fk4Jz+GJtX4191xz1ePwbGKRYpyJQg58s9/nl5UobMvQNsx/cBAlX6ebemMcjD9YiCC1HK3rU9a5v8TDffqVpG50fbuL+c7aWWshMeIveat4WFTGPgnvAvT+ojQSSi2cVIL5qB/7s3uZkCOXTGeaTeKvCTF+d5U6DMjbTP5oOPGpcgWGzqvxT+0/fVDRQayTTsNGfxRGCDRwEIqBKSbo6HnMmQSt6zXtICUfVmldm+20kIwtaqej98tDRsB1/WUnaQaIjCeGHv8rZoqPla9t+8vk9bTHrJ6h9pxacNnECrtcSvA0Zs7u8Z3wkEVm25Uq6Kzdl8NqhWLIG8ct7Mmgs7p3Oj/5Qsrnt2+zUdVGOXwCKiDQnMsoeJ9/a3/p4pY+tnx6d9M5sbourxQ== alexb@Bancey-W11",
                ]
              + password = (sensitive value)
            }
        }

      + memory {
          + dedicated = 512
          + swap      = 0
        }

      + network_interface {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "eth0"
          + rate_limit  = 0
          + vlan_id     = 16
        }

      + operating_system {
          + template_file_id = "local:vztmpl/ubuntu-24.04-standard_24.04-2_amd64.tar.zst"
          + type             = "ubuntu"
        }

      + startup {
          + down_delay = -1
          + order      = 2
          + up_delay   = 10
        }
    }

Plan: 10 to add, 0 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tiny_k8s_virtual_machines["hela-tiny-node0"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                                   = "220"
      ~ mac_addresses                        = [
            # (13 unchanged elements hidden)
            "EE:D3:6D:66:E1:C1",
          - "9A:30:24:3A:39:AA",
            "66:C5:0D:B6:5A:A5",
            # (13 unchanged elements hidden)
        ]
        name                                 = "tiny-node0"
        tags                                 = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (34 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-node1"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                                   = "221"
      ~ mac_addresses                        = [
            # (25 unchanged elements hidden)
            "26:AC:11:66:44:C2",
          ~ "76:CA:D1:33:C0:6E" -> "92:2D:49:10:82:7C",
          ~ "92:2D:49:10:82:7C" -> "7A:5A:59:7A:F7:3F",
        ]
        name                                 = "tiny-node1"
        tags                                 = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (34 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-node2"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                                   = "222"
      ~ mac_addresses                        = [
            # (13 unchanged elements hidden)
            "3A:3D:F7:A9:5C:8C",
          ~ "D6:EF:87:61:58:92" -> "F2:1D:0E:B9:8D:72",
          ~ "F2:1D:0E:B9:8D:72" -> "26:CB:07:7A:B3:3B",
          ~ "26:CB:07:7A:B3:3B" -> "02:47:27:C3:77:5A",
          ~ "02:47:27:C3:77:5A" -> "66:6E:0E:09:4A:85",
          ~ "66:6E:0E:09:4A:85" -> "62:3D:98:99:9D:7D",
          ~ "62:3D:98:99:9D:7D" -> "46:16:61:71:FA:07",
          ~ "46:16:61:71:FA:07" -> "7E:97:FA:9C:E7:97",
          ~ "7E:97:FA:9C:E7:97" -> "FA:3B:C9:FE:06:58",
          ~ "FA:3B:C9:FE:06:58" -> "7E:70:0F:6C:3A:C8",
          ~ "7E:70:0F:6C:3A:C8" -> "4E:B4:A3:44:6F:A1",
          ~ "4E:B4:A3:44:6F:A1" -> "E6:63:D6:CA:1E:24",
          ~ "E6:63:D6:CA:1E:24" -> "7E:23:AC:D8:DF:49",
          ~ "7E:23:AC:D8:DF:49" -> "7E:7B:25:C8:A2:EB",
          ~ "7E:7B:25:C8:A2:EB" -> "82:98:A6:C6:F8:4C",
          ~ "82:98:A6:C6:F8:4C" -> "EA:C0:07:1D:54:80",
          ~ "EA:C0:07:1D:54:80" -> "D2:52:65:CC:0A:D1",
        ]
        name                                 = "tiny-node2"
        tags                                 = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (34 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1110,"Program":"tfcmt","SHA1":"","Target":"tiny_virtual_machines","Vars":{}} -->